eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  ledcWrite(kTestLedPwmChannel, duty);
}

void applyOnboardTestLedDuty(uint8_t duty) {
  if (!gOnboardTestLedAvailable) {
    return;
  }

#if defined(RGB_BUILTIN) || defined(PIN_NEOPIXEL)
  neopixelWrite(kOnboardTestLedPin, duty, duty, duty);
#else
  (void)duty;
#endif
}

void applyTestLedDutyToOutputs(uint8_t duty) {
  applyAuxTestLedDuty(duty);
  applyOnboardTestLedDuty(duty);
}

void applyTestLedState() {
  if (!isTestLedAvailable()) {
    return;
  }

  if (gTestLedUntilMs > 0) {
    applyTestLedDutyToOutputs(gTestLedState ? gTestLedPulseDuty : 0);
    return;
  }

  if (gAuxLedAvailable && gTestLedEnabled) {
    applyAuxTestLedDuty(gTestLedDuty);
  } else {
    applyAuxTestLedDuty(0);
  }

  applyOnboardTestLedDuty(0);
}

void updateTestLedDutyFromBrightness(uint8_t brightness) {
  if (!gAuxLedAvailable) {
    gTestLedDuty = 0;
  } else if (gTestLedDuty != brightness) {
    gTestLedDuty = brightness;
  }

  gTestLedPulseDuty = brightness;
  if (gTestLedUntilMs == 0) {
    applyTestLedState();
  }
}

void setMatrixBrightness(uint8_t brightness) {
  if (gAppliedBrightness == brightness) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrixReady && gMatrix != nullptr) {
    gMatrix->setBrightness8(brightness);
  }
#endif

  gAppliedBrightness = brightness;
}

void clearMatrix() {
  if (!gMatrixReady) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->clearScreen();
  }
#endif
}

void drawMatrixPixel(uint8_t x, uint8_t y, const RgbColor& color) {

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->drawPixelRGB888(x, y, color.r, color.g, color.b);
  }
#endif
}

void commitMatrixFrame() {
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#pontos-de-alteracao-frequente
bool initMatrixDisplay() {

#if defined(MICA_PROFILE_DMA_EXP)
  HUB75_I2S_CFG::i2s_pins pinMap = {
      static_cast<int8_t>(kMatrixRgbPins[0]),
      static_cast<int8_t>(kMatrixRgbPins[1]),
      static_cast<int8_t>(kMatrixRgbPins[2]),
      static_cast<int8_t>(kMatrixRgbPins[3]),
      static_cast<int8_t>(kMatrixRgbPins[4]),
      static_cast<int8_t>(kMatrixRgbPins[5]),
      static_cast<int8_t>(kMatrixAddrPins[0]),
      static_cast<int8_t>(kMatrixAddrPins[1]),
      static_cast<int8_t>(kMatrixAddrPins[2]),
      static_cast<int8_t>(kMatrixAddrPins[3]),
      static_cast<int8_t>(-1),
      static_cast<int8_t>(kMatrixLatchPin),
      static_cast<int8_t>(kMatrixOePin),
      static_cast<int8_t>(kMatrixClockPin)};

  HUB75_I2S_CFG config(kMatrixWidth, kMatrixHeight, 1, pinMap);
  config.i2sspeed = HUB75_I2S_CFG::HZ_10M;
  config.clkphase = false;

  gMatrix = new MatrixPanel_I2S_DMA(config);
  if (gMatrix == nullptr) {
    Serial.println("Falha ao alocar MatrixPanel_I2S_DMA.");
    return false;
  }

  if (!gMatrix->begin()) {
    Serial.println("Falha ao inicializar MatrixPanel_I2S_DMA.");
    delete gMatrix;
    gMatrix = nullptr;
    return false;
  }
#endif

  gMatrixReady = true;
  gAppliedBrightness = 0;
  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  clearMatrix();
  commitMatrixFrame();
  return true;
}

bool postJsonWithAuth(const String& path, JsonDocument& doc) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    return false;
  }

  HTTPClient http;
  String url = "http://" + gServerHost + ":" + String(gServerPort) + path;
  if (!http.begin(url)) {
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);

  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  http.end();

  return code >= 200 && code < 300;
}

String normalizeLowerHex(const String& value) {
  String normalized = value;
  normalized.trim();
  normalized.toLowerCase();
  return normalized;
}

String bytesToLowerHex(const uint8_t* bytes, size_t length) {
  const char* hex = "0123456789abcdef";
  String result;
  result.reserve(length * 2u);
  for (size_t index = 0; index < length; index++) {
    const uint8_t value = bytes[index];
    result += hex[(value >> 4) & 0x0Fu];
    result += hex[value & 0x0Fu];
  }

  return result;
}

bool beginHttpWithDeviceAuth(HTTPClient& http, const String& path) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    return false;
  }

  String normalizedPath = path;
  if (!normalizedPath.startsWith("/")) {
    normalizedPath = "/" + normalizedPath;
  }

  String url = "http://" + gServerHost + ":" + String(gServerPort) + normalizedPath;
  if (!http.begin(url)) {
    return false;
  }

  http.setConnectTimeout(5000);
  http.setTimeout(15000);
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);
  return true;
}

bool tryParseFirmwareReleaseInfo(const JsonDocument& document, FirmwareReleaseInfo& info) {
  const char* firmwareVersion = document["firmwareVersion"] | "";
  const char* boardModel = document["boardModel"] | "";
  const char* panelType = document["panelType"] | "";
  const char* profile = document["profile"] | "";
  const char* controlPlane = document["controlPlane"] | "";
  const char* sha256 = document["sha256"] | "";
  const char* downloadPath = document["downloadPath"] | "";
  const uint32_t fileSizeBytes = document["fileSizeBytes"] | 0u;

  if (firmwareVersion[0] == '\0'
      || boardModel[0] == '\0'
      || panelType[0] == '\0'
      || profile[0] == '\0'
      || controlPlane[0] == '\0'
      || sha256[0] == '\0'
      || downloadPath[0] == '\0'
      || fileSizeBytes == 0u) {
    return false;
  }

  info.firmwareVersion = firmwareVersion;
  info.boardModel = boardModel;
  info.panelType = panelType;
  info.profile = profile;
  info.controlPlane = controlPlane;
  info.sha256 = normalizeLowerHex(sha256);
  info.fileSizeBytes = fileSizeBytes;
  info.downloadPath = downloadPath;
  return true;
}

bool validateFirmwareReleaseInfo(const FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage) {
  if (!requestedVersion.isEmpty() && !info.firmwareVersion.equalsIgnoreCase(requestedVersion)) {
    errorCode = "firmware_version_mismatch";
    errorMessage = "Servidor retornou versao diferente da solicitada para OTA.";
    return false;
  }

