eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  if (!info.boardModel.equalsIgnoreCase(kBoardModel)
      || !info.panelType.equalsIgnoreCase(kPanelType)
      || !info.profile.equalsIgnoreCase(kFirmwareProfile)) {
    errorCode = "firmware_incompatible";
    errorMessage = "Firmware oficial nao corresponde ao hardware/perfil deste dispositivo.";
    return false;
  }

  if (!info.controlPlane.equalsIgnoreCase("mqtt")) {
    errorCode = "firmware_control_plane_invalid";
    errorMessage = "Firmware oficial incompativel com o control plane atual.";
    return false;
  }

  if (info.sha256.length() != 64) {
    errorCode = "firmware_sha_invalid";
    errorMessage = "Manifesto de firmware sem hash SHA-256 valido.";
    return false;
  }

  if (info.fileSizeBytes == 0u) {
    errorCode = "firmware_size_invalid";
    errorMessage = "Manifesto de firmware sem tamanho valido.";
    return false;
  }

  return true;
}

bool tryFetchLatestFirmwareRelease(FirmwareReleaseInfo& info, const String& requestedVersion, String& errorCode, String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  HTTPClient http;
  if (!beginHttpWithDeviceAuth(http, "/api/v1/device/firmware/latest")) {
    errorCode = "firmware_http_begin_failed";
    errorMessage = "Nao foi possivel consultar o catalogo oficial de firmware.";
    return false;
  }

  int code = http.GET();
  if (code == HTTP_CODE_NOT_FOUND) {
    errorCode = "firmware_not_found";
    errorMessage = "Nao existe pacote oficial de firmware para este dispositivo.";
    http.end();
    return false;
  }

  if (code < 200 || code >= 300) {
    errorCode = "firmware_http_error";
    errorMessage = String("Falha ao consultar firmware oficial. HTTP ") + code + ".";
    http.end();
    return false;
  }

  JsonDocument response;
  if (deserializeJson(response, http.getString()) != DeserializationError::Ok) {
    errorCode = "firmware_manifest_invalid";
    errorMessage = "Resposta de firmware oficial invalida.";
    http.end();
    return false;
  }
  http.end();

  if (!tryParseFirmwareReleaseInfo(response, info)) {
    errorCode = "firmware_manifest_invalid";
    errorMessage = "Resposta de firmware oficial incompleta.";
    return false;
  }

  return validateFirmwareReleaseInfo(info, requestedVersion, errorCode, errorMessage);
}

bool performFirmwareOta(const FirmwareReleaseInfo& info, const String& commandId, String& errorCode, String& errorMessage) {
  errorCode = "";
  errorMessage = "";

  sendCommandProgress(commandId, 35, "metadata", "Firmware oficial validado.");
  if (gWs.isConnected()) {
    gWs.disconnect();
  }

  if (gMatrixReady) {
    clearMatrix();
    commitMatrixFrame();
  }

  HTTPClient http;
  if (!beginHttpWithDeviceAuth(http, info.downloadPath)) {
    errorCode = "firmware_download_begin_failed";
    errorMessage = "Nao foi possivel iniciar o download OTA.";
    return false;
  }

  int code = http.GET();
  if (code < 200 || code >= 300) {
    errorCode = "firmware_download_http_error";
    errorMessage = String("Falha ao baixar firmware oficial. HTTP ") + code + ".";
    http.end();
    return false;
  }

  const int contentLength = http.getSize();
  if (contentLength <= 0 || static_cast<uint32_t>(contentLength) != info.fileSizeBytes) {
    errorCode = "firmware_download_size_mismatch";
    errorMessage = "Download OTA retornou tamanho diferente do manifesto oficial.";
    http.end();
    return false;
  }

  if (!Update.begin(info.fileSizeBytes)) {
    errorCode = "ota_begin_failed";
    errorMessage = String("Nao foi possivel reservar espaco OTA. code=") + Update.getError();
    http.end();
    return false;
  }

  WiFiClient* stream = http.getStreamPtr();
  if (stream == nullptr) {
    Update.abort();
    errorCode = "firmware_stream_unavailable";
    errorMessage = "Fluxo HTTP indisponivel para OTA.";
    http.end();
    return false;
  }

  mbedtls_sha256_context shaContext;
  mbedtls_sha256_init(&shaContext);
  if (mbedtls_sha256_starts_ret(&shaContext, 0) != 0) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_sha_init_failed";
    errorMessage = "Falha ao inicializar validacao SHA-256 da OTA.";
    http.end();
    return false;
  }

  uint8_t buffer[4096];
  uint32_t totalRead = 0u;
  unsigned long lastDataMs = millis();
  uint8_t lastProgress = 35u;

  while (totalRead < info.fileSizeBytes) {
    const size_t availableBytes = stream->available();
    if (availableBytes == 0u) {
      if (!http.connected()) {
        break;
      }

      if (millis() - lastDataMs > 15000u) {
        Update.abort();
        mbedtls_sha256_free(&shaContext);
        errorCode = "firmware_download_timeout";
        errorMessage = "Download OTA interrompido por timeout.";
        http.end();
        return false;
      }

      delay(1);
      continue;
    }

    const size_t chunkSize = availableBytes < sizeof(buffer) ? availableBytes : sizeof(buffer);
    const int readCount = stream->readBytes(buffer, chunkSize);
    if (readCount <= 0) {
      delay(1);
      continue;
    }

    lastDataMs = millis();
    if (mbedtls_sha256_update_ret(&shaContext, buffer, static_cast<size_t>(readCount)) != 0) {
      Update.abort();
      mbedtls_sha256_free(&shaContext);
      errorCode = "firmware_sha_update_failed";
      errorMessage = "Falha ao atualizar hash SHA-256 durante OTA.";
      http.end();
      return false;
    }

    if (Update.write(buffer, static_cast<size_t>(readCount)) != static_cast<size_t>(readCount)) {
      Update.abort();
      mbedtls_sha256_free(&shaContext);
      errorCode = "ota_write_failed";
      errorMessage = String("Falha ao gravar bloco OTA. code=") + Update.getError();
      http.end();
      return false;
    }

    totalRead += static_cast<uint32_t>(readCount);
    const uint8_t progress = static_cast<uint8_t>(35u + ((static_cast<uint64_t>(totalRead) * 55u) / info.fileSizeBytes));
    if (progress >= static_cast<uint8_t>(lastProgress + 5u) || totalRead >= info.fileSizeBytes) {
      lastProgress = progress;
      sendCommandProgress(commandId, progress > 90u ? 90u : progress, "downloading", "Baixando e gravando firmware...");
    }
  }

  http.end();

  if (totalRead != info.fileSizeBytes) {
    Update.abort();
    mbedtls_sha256_free(&shaContext);
    errorCode = "firmware_download_incomplete";
    errorMessage = "Download OTA terminou antes de receber todos os bytes esperados.";
    return false;
  }

