eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  gBrightnessCap = clampBrightnessToSafeRange(static_cast<int>(gPrefs.getUChar("brightnessCap", kBrightnessDefaultCap)));
  gTestLedEnabled = gPrefs.getBool("testLedEnabled", false);
  gStreamBrightness = gBrightnessCap;
  gAppliedBrightness = resolveAppliedBrightness();
  initializeOnboardTestLed();
  initializeAuxLed();

  if (!initMatrixDisplay()) {
    Serial.println("Painel HUB75 indisponivel: exibicao de barras desativada.");
  }

  updateTestLedDutyFromBrightness(resolveAppliedBrightness());
  applyTestLedState();

  gServerHost = gPrefs.getString("host", "");
  gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
  gMqttHost = gPrefs.getString("mqttHost", "");
  gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
  gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
  normalizeMqttConfig();
  gDeviceId = gPrefs.getString("deviceId", "");
  gToken = gPrefs.getString("token", "");
  gActiveAppId = gPrefs.getString("activeAppId", "");
  gActiveAppName = gPrefs.getString("activeAppName", "");
  gActiveAppConfig = gPrefs.getString("activeAppConfig", "");
  loadPendingOtaContext();
  initializePendingOtaBootState();

  const bool missingServerConfig = gServerHost.isEmpty() || gServerPort == 0;
  const bool missingDeviceCredentials = gDeviceId.isEmpty() || gToken.isEmpty();
  if (missingServerConfig || missingDeviceCredentials) {
    const char* bootReason = missingServerConfig
        ? "boot_missing_server_config"
        : "boot_missing_device_credentials";
    Serial.printf("[boot] configuracao incompleta; abrindo provisioning portal (%s).\n", bootReason);
    (void)startProvisioningPortal(bootReason);

    gServerHost = gPrefs.getString("host", "");
    gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
    gMqttHost = gPrefs.getString("mqttHost", "");
    gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
    gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
    normalizeMqttConfig();
    gDeviceId = gPrefs.getString("deviceId", "");
    gToken = gPrefs.getString("token", "");
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin();

  bool bootWifiConnected = false;
  if (!gServerHost.isEmpty() && gServerPort != 0) {
    unsigned long bootWifiWaitStart = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - bootWifiWaitStart) < 5000) {
      processSerialProvisioning();
      delay(120);
    }

    bootWifiConnected = WiFi.status() == WL_CONNECTED;
  }

  if (gServerHost.isEmpty() || gServerPort == 0 || gDeviceId.isEmpty() || gToken.isEmpty()) {
    Serial.println("[wifi_connecting] aguardando provisioning por AP para concluir configuracao.");
    setConnectivityState(kWifiStateDisconnected, "boot_missing_server_config", true);
    gWifiDisconnectedSinceMs = millis();
  } else if (bootWifiConnected) {
    Serial.println("[wifi_connected] Wi-Fi conectado no boot.");
    setConnectivityState(kWifiStateConnected, "wifi_connected", true);
    connectMqtt();
    connectWebSocket();
  } else {
    Serial.println("[wifi_connecting] sem Wi-Fi no boot, aguardando reconexao.");
    setConnectivityState(kWifiStateDisconnected, "boot_waiting_wifi", true);
    gWifiDisconnectedSinceMs = millis();
  }

  sendSerialHello();
}

void loop() {
  const uint32_t loopStartedUs = micros();
  processSerialProvisioning();
  processPendingOtaSafeUpdate();
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;

  if (!wifiConnected) {
    if (gWifiDisconnectedSinceMs == 0) {
      gWifiDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateDisconnected, "wifi_disconnected", true);
      Serial.println("[wifi] desconectado, aguardando reconexao.");
    }

    if (!gProvisioningPortalActive
        && (millis() - gWifiDisconnectedSinceMs) > kWifiDisconnectProvisioningFallbackMs) {
      Serial.println("[wifi] fallback para provisioning apos queda prolongada.");
      (void)startProvisioningPortal("wifi_disconnected_fallback");
      gWifiDisconnectedSinceMs = 0;
      connectMqtt();
      connectWebSocket();
    } else {
      delay(120);
    }

    processSerialProvisioning();
    updateTestLed();
    updateLoopHealthyPercent(static_cast<uint32_t>(micros() - loopStartedUs));
    return;
  }

  if (gWifiDisconnectedSinceMs != 0) {
    gWifiDisconnectedSinceMs = 0;
  }

  if (gProvisioningPortalActive) {
    setProvisioningPortalActive(false, "portal_closed");
  }

  setConnectivityState(kWifiStateConnected, "wifi_connected");
  gMqtt.loop();
  gWs.loop();
  flushWsFlapDiagnostics(false);

  if (!gMqtt.connected()) {
    if (gMqttDisconnectedSinceMs == 0) {
      gMqttDisconnectedSinceMs = millis();
    }

    if (millis() - gMqttDisconnectedSinceMs >= kMqttReconnectRetryMs) {
      connectMqtt();
      gMqttDisconnectedSinceMs = millis();
    }
  } else {
    gMqttDisconnectedSinceMs = 0;
    sendTelemetry(false);
  }

  if (!gWs.isConnected()) {
    if (gWsDisconnectedSinceMs == 0) {
      gWsDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateConnected, "ws_disconnected", false, false);
    }

    if (millis() - gWsDisconnectedSinceMs > kWsReconnectRetryMs) {
      Serial.println("[ws_disconnected] sem sessao por tempo prolongado; tentando reconectar websocket.");
      connectWebSocket();
      gWsDisconnectedSinceMs = millis();
    }
  } else {
    gWsDisconnectedSinceMs = 0;
  }

  if (millis() - gLastFrameMs > 15000) {
    memset(gBins, 0, sizeof(gBins));
    gLevel = 0;
    memset(gFrameRgb565, 0, sizeof(gFrameRgb565));
    gFrameModeActive = false;
  }

  updateTestLed();
  processSerialProvisioning();
  if (gFrameModeActive) {
    drawFrame128x64();
  } else {
    drawBars();
  }

  updateLoopHealthyPercent(static_cast<uint32_t>(micros() - loopStartedUs));
}
